---
kind: type
id: T:Autodesk.Revit.DB.Fabrication.ValidationStatus
source: html/bf3700c3-dd66-1655-a0cd-e610c1aff5f2.htm
---
# Autodesk.Revit.DB.Fabrication.ValidationStatus

Lists the validation type of the fabrication part.

## Syntax (C#)
```csharp
public enum ValidationStatus
```